// Задача 32: Задайте массив из восьми элементов, заполненных нулями 
// и единицами. Выведите их на экран
Console.WriteLine("Hello, World!");
