// Задача 30: Покажите кубы чисел, заканчивающихся на чётную цифру.
Console.WriteLine("Hello, World!");
