// Задача 26: Возведите число А в натуральную степень B, используя цикл.
int num = 3;
Console.WriteLine(Math.Pow(3, 3));
